Tekla.Structures.Geometry3d.PlaneConversions
The Tekla.Structures.Geometry3d.PlaneConversions class converts structures representing planes
from Tekla.Structures.Geometry3d to Tekla.Common.Geometry.

Tekla.Structures.Geometry3d.PlaneConversions.ToPlane3(Tekla.Structures.Geometry3d.GeometricPlane)
Converts a Tekla.Structures.Geometry3d.GeometricPlane to a Tekla.Common.Geometry.Plane3.
geometricPlane: The Tekla.Structures.Geometry3d.GeometricPlane to convert.
Returns: The resulting Tekla.Common.Geometry.Plane3.

Tekla.Structures.Geometry3d.PlaneConversions.ToPlane3(Tekla.Structures.Model.Plane)
Converts a Tekla.Structures.Model.Plane to a Tekla.Common.Geometry.Plane3.
plane: The Tekla.Structures.Model.Plane to convert.
Returns: The resulting Tekla.Common.Geometry.Plane3.

Tekla.Structures.Geometry3d.PlaneConversions.ToPlane3List(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.GeometricPlane})
Creates a list of Tekla.Structures.Geometry3d.GeometricPlane values from an System.Collections.Generic.IEnumerable`1 of Tekla.Common.Geometry.Plane3 values.
geometricPlanes: The collection of Tekla.Structures.Geometry3d.GeometricPlane values to convert.
Returns: The resulting list of Tekla.Common.Geometry.Plane3 values.

Tekla.Structures.Geometry3d.PlaneConversions.ToFace3(Tekla.Structures.Solid.Face)
Converts an Tekla.Structures.Solid.Face to a Tekla.BIM.Geometry.Face3.
face:  The Tekla.Structures.Solid.Face to convert.
Returns:  The resulting Tekla.BIM.Geometry.Face3.

Tekla.Structures.Geometry3d.PlaneConversions.ToFace3(Tekla.Structures.Model.Polygon)
Converts a Tekla.Structures.Model.Polygon to a Tekla.BIM.Geometry.Face3.
polygon:  The Tekla.Structures.Model.Polygon to convert.
Returns:  The resulting Tekla.BIM.Geometry.Face3.

Tekla.Structures.Geometry3d.PlaneConversions.ToFace3(Tekla.Structures.Model.Polygon,Tekla.Common.Geometry.UnitVector3)
Converts a Tekla.Structures.Model.Polygon to a Tekla.BIM.Geometry.Face3.
polygon: The Tekla.Structures.Model.Polygon to convert.
normal: The expected normal of the Tekla.Structures.Model.Polygon face.
Returns:  The resulting Tekla.BIM.Geometry.Face3.

Tekla.Structures.Geometry3d.PlaneConversions.ToFace3(System.Collections.Generic.ICollection{Tekla.Structures.Geometry3d.Point})
Converts a point collection to a Tekla.BIM.Geometry.Face3.
pointList: The point collection.
Returns: The resulting Tekla.BIM.Geometry.Face3 or null if the face is invalid.

Tekla.Structures.Geometry3d.PlaneConversions.ToFace3Array(System.Collections.Generic.IEnumerable{System.Collections.Generic.List{Tekla.Structures.Geometry3d.Point}})
Converts an array of point collections to an array of Tekla.BIM.Geometry.Face3.
pointsList: The point collection.
Returns: The resultingarray of faces.

Tekla.Structures.Geometry3d.PlaneConversions.Normal(Tekla.Structures.Model.Plane)
Gets the normal to the Tekla.Structures.Model.Plane as a Tekla.Structures.Geometry3d.Vector.
plane: The Tekla.Structures.Model.Plane value to get the normal of.
Returns: The normal as a Tekla.Structures.Geometry3d.Vector value.

Tekla.Structures.Geometry3d.PlaneConversions.ToGeometricPlane(Tekla.Structures.Model.Plane)
Creates a Tekla.Structures.Geometry3d.GeometricPlane from a Tekla.Structures.Model.Plane value.
plane: The Tekla.Structures.Model.Plane to convert
Returns: A Tekla.Structures.Geometry3d.GeometricPlane value.

Tekla.Structures.Geometry3d.PlaneConversions.GetFacePoints(Tekla.Structures.Model.Polygon)
Gets the contour points of the Tekla.Structures.Model.Polygon, when interpreted as a face.
polygon: The Tekla.Structures.Model.Polygon to get the contour points for.
Returns: The contour points of the face for polygon.